SoCXin/nRF52832/src/project/examples/ble_peripheral/test/main.c
    uint32_t err_code = bsp_init(BSP_INIT_LEDS, NULL);
    APP_ERROR_CHECK(err_code);

}

static void beep_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
	  nrf_gpio_pin_clear(BEEP_PIN);
}
static void saadc_timeout_handler(void * p_context)
{
    nrf_saadc_value_t  saadc_val;
	
	  UNUSED_PARAMETER(p_context);
	
	  //启动一次ADC采样（阻塞模式）。
		 nrfx_saadc_sample_convert(0,&saadc_val);
		 //串口输出ADC采样值。
		 printf("Sample value is:  %d\r\n", saadc_val);
		 
		 //串口输出采样值计算得到的电压值。电压值 = 采样值 * 3.6 /1024
		 printf("Voltage = %.3fV\r\n", saadc_val * 3.6 /1024);
}

static void mpu6050_timeout_handler(void * p_context)
{
    int16_t AccValue[3],GyroValue[3];
  
	  UNUSED_PARAMETER(p_context);

	  MPU6050_ReadAcc( &AccValue[0], &AccValue[1] , &AccValue[2] );
	  MPU6050_ReadGyro(&GyroValue[0] , &GyroValue[1] , &GyroValue[2] );
	  //串口输出MPU6050基础数据
	  printf("ACC:  %d	%d	%d	",AccValue[0],AccValue[1],AccValue[2]);
	  printf("GYRO: %d	%d	%d	\r\n",GyroValue[0],GyroValue[1],GyroValue[2]);
}


static void timers_init(void)
{
    //初始化APP定时器
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
	
	  err_code = app_timer_create(&beep_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                beep_timeout_handler);
    APP_ERROR_CHECK(err_code);
	
	  err_code = app_timer_create(&saadc_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                saadc_timeout_handler);
    APP_ERROR_CHECK(err_code);
	
	  err_code = app_timer_create(&mpu6050_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                mpu6050_timeout_handler);
    APP_ERROR_CHECK(err_code);
}
//SAADC事件回调函数，因为是堵塞模式，所以不需要事件，这里定义了一个空的事件回调函数
void saadc_callback(nrf_drv_saadc_evt_t const * p_event){}
//初始化SAADC，配置使用的SAADC通道的参数
void saadc_init(void)
{
    ret_code_t err_code;
	  //定义ADC通道配置结构体，并使用单端采样配置宏初始化，
	  //NRF_SAADC_INPUT_AIN2是使用的模拟输入通道
    nrf_saadc_channel_config_t channel_config = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);
    //初始化SAADC，注册事件回调函数。
	  err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);
    //初始化SAADC通道0
    err_code = nrfx_saadc_channel_init(0, &channel_config);
    APP_ERROR_CHECK(err_code);

}
void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    ret_code_t err_code;
	  switch (pin_no)
    {
        case BUTTON_1:
           if(button_action == APP_BUTTON_PUSH)
					 {
						 nrf_gpio_pin_toggle(LED_1);
					 }
           break;
        case BUTTON_2:
					 if(button_action == APP_BUTTON_PUSH)
					 {
						 nrf_gpio_pin_toggle(LED_2);
					 }
           break;
        case BUTTON_3:
           if(button_action == APP_BUTTON_PUSH)
					 {
						 nrf_gpio_pin_toggle(LED_3);
					 }
           break;
				case BUTTON_4:
           if(button_action == APP_BUTTON_PUSH)
					 {
						 nrf_gpio_pin_toggle(LED_4);
					 }
           break;
				case TOUCH_PIN:
				   nrf_gpio_pin_set(BEEP_PIN);
				   err_code = app_timer_start(beep_timer_id, BEEP_INTERVAL, NULL);
           APP_ERROR_CHECK(err_code);
           break;

        default:
            return; 
    }
}
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {BUTTON_1, APP_BUTTON_ACTIVE_LOW, BUTTON_PULL, button_event_handler},
				{BUTTON_2, APP_BUTTON_ACTIVE_LOW, BUTTON_PULL, button_event_handler},
				{BUTTON_3, APP_BUTTON_ACTIVE_LOW, BUTTON_PULL, button_event_handler},
				{BUTTON_4, APP_BUTTON_ACTIVE_LOW, BUTTON_PULL, button_event_handler},
				{TOUCH_PIN, APP_BUTTON_ACTIVE_HIGH, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
		
		
		err_code = app_button_enable();
            APP_ERROR_CHECK(err_code);
}
/**@brief Function for application main entry.
 */
int main(void)
{
	  uint32_t err_code;
	  //定义地址结构体变量my_addr
	  static ble_gap_addr_t  my_addr;
	
	  nrf_gpio_cfg_output(BEEP_PIN);
	  nrf_gpio_pin_clear(BEEP_PIN);
	
	  timers_init();
	  bsp_configuration();
	  buttons_init();
	  uart_init();
	  
    //初始化SAADC
	  saadc_init(); 

    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    printf("QITAS: nRF52832 TEST START!\r\n");
		
		/*---------------------------设置设备地址:随机静态地址-----------------------*/
		//初始化地址和地址类型
		my_addr.addr[0] = 0x11;
		my_addr.addr[1] = 0x22;
		my_addr.addr[2] = 0x33;
		my_addr.addr[3] = 0x44;
		my_addr.addr[4] = 0x55;
		my_addr.addr[5] = 0xcc;//注意地址最高两个位必须为1，其它所有的位不能同时为0，也不能同时为1
		my_addr.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;//地址类型设置为随机静态地址
		//写入地址
		err_code = sd_ble_gap_addr_set(&my_addr);//
		if(err_code != NRF_SUCCESS)
		{
			//打印设置地址失败
			NRF_LOG_INFO("Set Address Failed!");
		}
		/*---------------------------------END---------------------------------------*/
		
    advertising_start();
    
    // Enter main loop.
    for (;;)
    {
			
    }
}



